

[Original Comment](https://github.com/suzuki-shunsuke/test-github-action/discussions/181#discussioncomment-7477847) | _[Created by ghd2i](https://github.com/suzuki-shunsuke/ghd2i)_
<img width="32" alt="image" src="https://avatars.githubusercontent.com/u/13323303?u=afedf0091bfd70a6a79c55f6aca781c94cb862f7&v=4"> [suzuki-shunsuke](https://github.com/suzuki-shunsuke) <a href="#DC_kwDODTmpTc4AchpX" id="DC_kwDODTmpTc4AchpX">2023-05-25T12:49:40Z</a> ⬆️ 1 

## :x: Drift is detected



[CI link]()


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.example


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_repository.example will be created
  + resource "github_repository" "example" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tfaction"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>


